import React from "react";

const TermsOfService = () => {
  return (
    <div style={{ padding: "2rem", maxWidth: "800px", margin: "0 auto" }}>
      <h1>이용약관</h1>

      <section>
        <h2>제1조 (목적)</h2>
        <p>
          본 약관은 잡코리아 유한책임회사(이하 "회사")가 운영하는 "서비스"를
          이용함에 있어 "회사"와 회원간의 이용 조건 및 제반 절차, 권리, 의무 및
          책임사항, 기타 필요한 사항을 규정함을 목적으로 한다.
        </p>
      </section>

      <section>
        <h2>제2조 (용어의 정의)</h2>
        <p>
          이 약관에서 사용하는 용어의 정의는 아래와 같다. ① "사이트"라 함은
          회사가 서비스를 "회원"에게 제공하기 위하여 컴퓨터 등 정보통신설비를
          이용하여 설정한 가상의 영업장 또는 회사가 운영하는 웹사이트, 모바일웹,
          앱 등의 서비스를 제공하는 모든 매체를 통칭하며, 통합된 하나의 회원
          계정(아이디 및 비밀번호)을 이용하여 서비스를 제공받을 수 있는 아래의
          사이트를 말한다.
          <br />
          <br />
          <li>www.jobkorea.co.kr</li>
          <br />
          <li>www.albamon.com</li>
          <br />
          <li> m.jobkorea.co.kr</li>
          <br />
          <li>m.albamon.com</li>
          <br />
          <li>learning.jobkorea.co.kr</li>
          <br />
          ② "서비스"라 함은 회사가 운영하는 사이트를 통해 개인이 구직, 교육 등의
          목적으로 등록하는 자료를 DB화하여 각각의 목적에 맞게 분류 가공,
          집계하여 정보를 제공하는 서비스와 사이트에서 제공하는 모든 부대
          서비스를 말한다.
          <br />
          ③ "회원"이라 함은 "회사"가 제공하는 서비스를 이용하거나 이용하려는
          자로, 페이스북 등 외부 서비스 연동을 통해 "회사"와 이용계약을 체결한자
          또는 체결하려는 자를 포함하며, 아이디와 비밀번호의 설정 등 회원가입
          절차를 거쳐 회원가입확인 이메일 등을 통해 회사로부터 회원으로 인정받은
          "개인회원"을 말한다.
          <br />
          ④ "아이디"라 함은 회원가입 시 회원의 식별과 회원의 서비스 이용을
          위하여 "회원"이 선정하고 "회사"가 부여하는 문자와 숫자의 조합을
          말한다.
          <br />
          ⑤ "비밀번호"라 함은 위 제4항에 따라 회원이 회원가입시 아이디를
          설정하면서 아이디를 부여받은 자와 동일인임을 확인하고 "회원"의 권익을
          보호하기 위하여 "회원"이 선정한 문자와 숫자의 조합을 말한다.
          <br />⑥ "비회원"이라 함은 회원가입 절차를 거치지 않고 "회사"가
          제공하는 서비스를 이용하거나 하려는 자를 말한다.
        </p>
      </section>

      <section>
        <h2>제3조 (약관의 명시와 개정)</h2>
        <p>
          ① "회사"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명,
          사업자등록번호, 연락처 등을 "회원"이 알 수 있도록 초기 화면에
          게시하거나 기타의 방법으로 "회원"에게 공지해야 한다.
          <br /> ② "회사"는 약관의 규제에 관한 법률, 전기통신기본법,
          전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등
          관련법을 위반하지 않는 범위에서 이 약관을 개정할 수 있다. <br />③
          "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
          현행약관과 함께 그 개정약관의 적용일자 7일 전부터 적용일자 전일까지
          공지한다. 단 "회원"의 권리, 의무에 중대한 영향을 주는 변경의 경우에는
          적용일자 30일 전부터 공지하도록 한다.
          <br /> ④ "회원"은 변경된 약관에 대해 거부할 권리가 있다. "회원"은
          변경된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있다.
          "회원"이 거부하는 경우 본 서비스 제공자인 "회사"는 15일의 기간을
          정하여 "회원"에게 사전 통지 후 당해 "회원"과의 계약을 해지할 수 있다.
          만약, "회원"이 거부의사를 표시하지 않거나, 전항에 따라 시행일 이후에
          "서비스"를 이용하는 경우에는 동의한 것으로 간주한다.
        </p>
      </section>

      <section>
        <h2>제4조 (약관의 해석)</h2>
        <p>
          ① 이 약관에서 규정하지 않은 사항에 관해서는 약관의 규제에 관한 법률,
          전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에
          관한 법률 등의 관계법령에 따른다.
          <br /> ② 각 사이트 및 서비스 이용약관이 있는 경우에는 서비스
          이용약관이 우선한다.
          <br /> ③ "회원"이 "회사"와 개별 계약을 체결하여 서비스를 이용하는
          경우에는 개별 계약이 우선한다.
          <br />
        </p>
      </section>

      <section>
        <h2>제5조 (이용자의 의무)</h2>
        <p>
          ① "회사"의 서비스 이용계약(이하 "이용계약")은 서비스를 이용하고자 하는
          자가 본 약관과 개인정보처리방침을 읽고 "동의" 또는 "확인" 버튼을 누른
          경우 본 약관에 동의한 것으로 간주한다.
          <br /> ② 제1항 신청에 있어 "회사"는 "회원"의 종류에 따라 전문기관을
          통한 실명확인 및 본인인증을 요청할 수 있으며, "회원"은 본인인증에
          필요한 이름, 생년월일, 연락처 등을 제공하여야 한다.
          <br /> ③ "회원"이 이용신청(회원가입 신청) 작성 후에 "회사"가 웹상의
          안내 및 전자메일로 "회원"에게 통지함으로써 이용계약이 성립된다.
          <br /> ④ 페이스북 등 외부 서비스와의 연동을 통해 이용계약을 신청할
          경우, 본 약관과 개인정보취급방침, 서비스 제공을 위해 "회사"가 "회원"의
          외부 서비스 계정 정보 접근 및 활용에 "동의" 또는 "확인" 버튼을 누르면
          "회사"가 웹상의 안내 및 전자메일로 "회원"에게 통지함으로써 이용계약이
          성립된다.
          <br />
        </p>
      </section>

      <section>
        <h2>제6조 (이용신청의 승낙과 제한)</h2>
        <p>
          ① "회사"는 전조의 규정에 의한 이용신청 고객에 대하여 업무수행상 또는
          기술상 지장이 없는 경우에는 원칙적으로 접수순서에 따라 서비스 이용을
          승낙한다.
          <br /> ② "회사"는 아래사항에 해당하는 경우에 대해서는 서비스
          이용신청을 승낙하지 아니한다. 1. "회사"가 제시하는 내용을 기재하지
          않은 경우 2. 만 15세 미만의 아동이 신청한 경우 3. 이용자의 귀책사유로
          인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하여 신청하는
          경우 <br />③ "회사"는 아래사항에 해당하는 경우에는 그 신청에 대하여
          승낙제한 사유가 해소될 때까지 승낙을 유보할 수 있다. 1. "회사"가
          설비의 여유가 없는 경우 2. "회사"의 기술상 지장이 있는 경우 3. 기타
          "회사"의 귀책사유로 이용승낙이 곤란한 경우
          <br />
        </p>
      </section>

      <section>
        <h2>제7조 (서비스의 내용)</h2>
        <p>
          ① "회사"는 제2조 2항의 서비스를 제공할 수 있으며 그 내용은 다음 각
          호와 같다. <br /> 1. 이력서 등록 및 인재정보 게재 서비스 <br />
          2. 온라인 입사지원 서비스 <br />
          3. 헤드헌팅/아웃소싱 서비스 <br />
          4. 구인/구직과 관련된 제반 서비스 <br /> 5. 기업리뷰 등록과 조회
          서비스 <br />
          6. 기업정보 조회와 관련된 제반 서비스 <br />
          7. 교육과 관련된 제반 서비스 <br />
          8. 이용자간의 교류와 소통에 관련한 서비스 <br />
          9. 자료거래에 관련한 서비스 <br /> 10. 기타"회사"가 추가 개발, 편집,
          재구성하거나 제휴계약 등을 통해 “회원”에게 제공하는 일체의 서비스{" "}
          <br /> ② "회사"는 필요한 경우 서비스의 내용을 추가 또는 변경할 수
          있다. 단, 이 경우 "회사"는 추가 또는 변경내용을 "회원"에게 공지해야
          한다. <br />
        </p>
      </section>
      <section>
        <h2>제8조 (회원, 이력서 및 게시물 등의 정보)</h2>
        <p>
          ① "회원"의 이력서는 개인이 회원가입 또는 이력서 작성 및 수정시 희망한
          형태로 등록 및 제공된다.
          <br /> ② "회사"는 "회원"이 이력서의 인재정보 등록/미등록 지정,
          이력서상의 연락처 제공 여부를 자유롭게 선택할 수 있도록 하여야 한다.
          <br /> ③ "회사"는 "회원"이 이력서의 인재정보 등록 및 제공을 희망했을
          경우, 기업회원, 서치펌회원의 이력서 열람 및 각종 포지션 제안에 동의한
          것으로 간주하며 "회사"는 기업회원, 서치펌회원에게 유료로 이력서 열람
          서비스를 제공할 수 있다. 다만, 연락처 각 항목이 비공개로 지정된 경우
          해당 항목별 연락처를 노출할 수 없다. <br />④ "회사"는 안정적인
          서비스를 제공하기 위해 테스트 및 모니터링 용도로 "사이트" 운영자가
          이력서 및 게시물 등의 정보를 열람하도록 할 수 있다.
          <br /> ⑤ "회사"는 "회원"의 선택에 의하여 등록 및 제공되는 이력서 및
          게시물 등의 정보를 기준으로 구직활동에 보다 유익한 서비스를 제공하기
          위하여 이를 개발, 편집, 재구성한 통계 자료로 활용 할 수 있다.
          <br />
        </p>
      </section>
      <section>
        <h2>제 9 조 (제휴를 통한 서비스)</h2>
        <p>
          ① "회사"는 제휴 관계를 체결한 여타 인터넷 웹 사이트 및 채용박람회 또는
          신문, 잡지 등의 오프라인 매체를 통해 사이트에 등록한 "회원"의 이력서
          정보가 열람될 수 있도록 서비스를 제공할 수 있다. 단, 제휴 서비스를
          통해 노출되는 이력서의 연락처 정보는 “회원”이 이력서 등록 시 선택한
          연락처 공개 여부에 따라 제공된다. <br />② "회사"는 제휴를 통해 타
          사이트 및 매체에 등록될 수 있음을 고지해야 하며, 제휴 사이트 목록을
          사이트내에서 상시 열람할 수 있도록 해야 한다. 단, 등록의 형태가
          "회사"가 직접 구축하지 않고, 제휴사가 xml 또는 api 형태로 "회사"로부터
          제공 받아 구축한 매체 목록은 본 약관외 별도의 제휴리스트에서 열람할 수
          있도록 한다.
          <br /> ③ "회사"는 "회원"이 공개를 요청한 이력서에 한해 제휴를 맺은 타
          사이트에 이력서 정보를 제공한다. (본 약관 시행일 현재에는 제휴를 통한
          타 사이트 및 매체는 없다.)
          <br /> ④ 본 조 제 3항 제휴를 통한 사이트의 변동사항 발생 시 공지사항을
          통해 고지 후 진행 한다.
          <br />
        </p>
      </section>
      <section>
        <h2>제 10 조 (서비스의 요금)</h2>
        <p>
          ① "회원" 가입과 이력서 등록은 무료이다. 다만 기업회원 또는 사이트에
          방문한 기업체에게 자신의 이력서 정보를 보다 효과적으로 노출시키기 위한
          유료서비스 및 인성, 적성 검사 등 회원 가입 목적 외 기타 서비스를
          이용하기 위한 별도의 서비스는 유료로 제공될 수 있다.
          <br /> ② "회사"는 유료서비스를 제공할 경우 사이트에 요금에 대해서
          공지를 하여야 한다. <br />③ "회사"는 유료서비스 이용금액을 서비스의
          종류 및 기간에 따라 "회사"가 예고 없이 변경할 수 있다. 다만, 변경
          이전에 적용 또는 계약한 금액은 소급하여 적용하지 아니한다.
          <br />
        </p>
      </section>
      <p style={{ marginTop: "2rem", fontSize: "0.9rem", color: "#666" }}>
        ※ 본 약관은 2025년 7월 1일부터 적용됩니다.
      </p>
    </div>
  );
};

export default TermsOfService;
